# Question 1

Module Initialization:

Initially, a = 0 is set globally.
The function b() is defined, and inside it, global a is declared, meaning that b() modifies the global variable a.
The function c(a) is also defined and returns a + 2.
Execution of b() (First Call):

When b() is called for the first time, it references the global variable a.
Inside b(), the function c(a) is called with a = 0 as the argument.
c(0) returns 0 + 2 = 2, and this value is assigned back to a.
So, after the first call, a = 2.
Execution of b() (Second Call):

When b() is called again, it uses the updated global a, which is now 2.
Inside b(), the function c(a) is called with a = 2.
c(2) returns 2 + 2 = 4, and this value is assigned back to a.
So, after the second call, a = 4.
Execution of b() (Third Call):

When b() is called for the third time, it uses the updated global a, which is now 4.
Inside b(), the function c(a) is called with a = 4.
c(4) returns 4 + 2 = 6, and this value is assigned back to a.
So, after the third call, a = 6.
Final Value of a:

After three calls to b(), the value of a has been updated to 6.
Therefore, when you execute a, the result is 6

# Question 2

In [23]:
def fileLength(filename):
    try:
        with open(filename, 'r') as infile:  # Opening the file in read mode
            contents = infile.read()  # Reading the contents of the file
            return len(contents)  # Returning the length of the file contents
    except FileNotFoundError:  # Handling case when the file does not exist
        print(f"File {filename} not found.")
    except IOError:  # Handling other I/O related errors
        print(f"Cannot read file {filename}.")
        
    # Example Usage
length = fileLength('midterm.py')
if length is not None:
    print(length)

length = fileLength('idterm.py')
if length is not None:
    print(length)

51
File idterm.py not found.

# Question 3

In [24]:
# Define the Marsupial class
class Marsupial:
    def __init__(self):
        # Initialize an empty list to store pouch contents
        self.pouch = []
    
    def put_in_pouch(self, item):
        # Append the item to the pouch list
        self.pouch.append(item)
    
    def pouch_contents(self):
        # Return the contents of the pouch
        return self.pouch

# Define the Kangaroo class that inherits from Marsupial
class Kangaroo(Marsupial):
    def __init__(self, x, y):
        # Call the Marsupial constructor
        super().__init__()
        # Initialize coordinates
        self.x = x
        self.y = y
    
    def jump(self, dx, dy):
        # Adjust the coordinates by the given values
        self.x += dx
        self.y += dy
    
    def __str__(self):
        # Return the string representation of the Kangaroo's coordinates
        return f"I am a Kangaroo located at coordinates ({self.x},{self.y})"

# Example usage
m = Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
print(m.pouch_contents())  # Output: ['doll', 'firetruck', 'kitten']

k = Kangaroo(0, 0)
print(k)  # Output: I am a Kangaroo located at coordinates (0,0)
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
print(k.pouch_contents())  # Output: ['doll', 'firetruck', 'kitten']
k.jump(1, 0)
k.jump(1, 0)
k.jump(1, 0)
print(k)  # Output: I am a Kangaroo located at coordinates (3,0)

['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (0,0)
['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (3,0)

# Question 4

In [25]:
def collatz(x):
    # Base case: if x is 1, print 1 and return
    print(x)
    if x == 1:
        return
    # Recursive case: if x is even, call collatz with x / 2
    elif x % 2 == 0:
        collatz(x // 2)
    # Recursive case: if x is odd, call collatz with 3 * x + 1
    else:
        collatz(3 * x + 1)

# Call the function with examples
collatz(1)

collatz(10)

1
10
5
16
8
4
2
1

# Question 5

In [26]:
def binary(n):
    # Base case: when n is 0 or 1, print n
    if n < 2:
        print(n, end='')
    else:
        # Recursive case: print the binary of n // 2 first, then n % 2
        binary(n // 2)
        print(n % 2, end='')
        
binary(0)
print()  # Output: 0

binary(1)
print()  # Output: 1

binary(3)
print()  # Output: 11

binary(9)
print()  # Output: 1001

0
1
11
1001

# Question 6

In [27]:
from html.parser import HTMLParser

class HeadingParser(HTMLParser):
    def __init__(self):
        super().__init__()
        self.in_heading = False  # A flag to track if we're inside a heading tag
        self.heading_level = 0    # Track the level of heading (h1, h2, ..., h6)

    def handle_starttag(self, tag, attrs):
        # Check if the tag is a heading (h1, h2, ..., h6)
        if tag in ['h1', 'h2', 'h3', 'h4', 'h5', 'h6']:
            self.in_heading = True
            self.heading_level = int(tag[1])  # Extract the level number from tag (h1 -> 1, h2 -> 2, etc.)

    def handle_endtag(self, tag):
        # Reset the flag when the heading ends
        if tag in ['h1', 'h2', 'h3', 'h4', 'h5', 'h6']:
            self.in_heading = False

    def handle_data(self, data):
        # Print the data if we're inside a heading tag
        if self.in_heading:
            print(' ' * (self.heading_level - 1) + data.strip())

# Test the HeadingParser with w3c.html content
infile = open('w3c.html')
content = infile.read()
infile.close()

# Create an instance of HeadingParser and feed it the content
hp = HeadingParser()
hp.feed(content)

W3C Mission
 Principles

# Question 7

In [32]:
import requests
from html.parser import HTMLParser

class LinkParser(HTMLParser):
    def __init__(self):
        super().__init__()
        self.links = []

    def handle_starttag(self, tag, attrs):
        if tag == 'a':  # If the tag is an anchor (<a>), extract the URL
            for attr in attrs:
                if attr[0] == 'href':  # 'href' attribute contains the URL
                    self.links.append(attr[1])

def webdir(url, depth, indent):
    # Base case: if depth is less than 0, return
    if depth < 0:
        return
    
    # Print the current URL with the given indentation
    print(' ' * indent + url)
    
    try:
        # Fetch the content of the current URL
        response = requests.get(url)
        content = response.text
    except requests.exceptions.RequestException as e:
        print(f"Error fetching {url}: {e}")
        return
    
    # Parse the content to extract links
    parser = LinkParser()
    parser.feed(content)
    
    # Recursively visit each link, decreasing the depth and increasing the indentation
    for link in parser.links:
        # If the link is a relative path, construct the full URL
        if link.startswith('/'):
            link = requests.compat.urljoin(url, link)
        # Visit the linked page
        webdir(link, depth - 1, indent + 2)

# Example usage
webdir('http://reed.cs.depaul.edu/lperkovic/csc242/test1.html', 2, 0)

http://reed.cs.depaul.edu/lperkovic/csc242/test1.html

# Question 8

Firs creat the SQL Database

In [51]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [52]:
%sql sqlite:///my_database.db

In [53]:
%%sql
CREATE TABLE IF NOT EXISTS Weather (
    City TEXT,
    Country TEXT,
    Season TEXT,
    Temperature REAL,
    Rainfall REAL
);

 * sqlite:///my_database.db
Done.

[]

In [54]:
%%sql
INSERT INTO Weather (City, Country, Season, Temperature, Rainfall) VALUES
('Mumbai', 'India', 'Winter', 24.8, 5.9),
('Mumbai', 'India', 'Spring', 28.4, 16.2),
('Mumbai', 'India', 'Summer', 27.9, 1549.4),
('Mumbai', 'India', 'Fall', 27.6, 346.0),
('London', 'United Kingdom', 'Winter', 4.2, 207.7),
('London', 'United Kingdom', 'Spring', 8.3, 169.6),
('London', 'United Kingdom', 'Summer', 15.7, 157.0),
('London', 'United Kingdom', 'Fall', 10.4, 218.5),
('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
('Cairo', 'Egypt', 'Fall', 22.2, 4.5);

 * sqlite:///my_database.db
12 rows affected.

[]

In [55]:
%%sql
SELECT * FROM Weather;

 * sqlite:///my_database.db
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

a) All the temperature data:

In [63]:
%%sql
SELECT Temperature FROM Weather;

 * sqlite:///my_database.db
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

b) All the cities, but without repetition:

In [64]:
%%sql
SELECT DISTINCT City FROM Weather;

 * sqlite:///my_database.db
Done.

[('Mumbai',), ('London',), ('Cairo',)]

c) All the records for India:

In [65]:
%%sql
SELECT * FROM Weather WHERE Country = 'India';

 * sqlite:///my_database.db
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0)]

d) All the Fall records:

In [66]:
%%sql
SELECT * FROM Weather WHERE Season = 'Fall';

 * sqlite:///my_database.db
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

e) The city, country, and season for which the average rainfall is between 200 and 400 millimeters:

In [67]:
%%sql
SELECT City, Country, Season FROM Weather WHERE Rainfall BETWEEN 200 AND 400;

 * sqlite:///my_database.db
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall')]

f) The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order:

In [68]:
%%sql
SELECT City, Country FROM Weather WHERE Season = 'Fall' AND Temperature > 20 ORDER BY Temperature ASC;

 * sqlite:///my_database.db
Done.

[('Cairo', 'Egypt'), ('Mumbai', 'India')]

g) The total annual rainfall for Cairo:

In [69]:
%%sql
SELECT SUM(Rainfall) AS Total_Annual_Rainfall FROM Weather WHERE City = 'Cairo';

 * sqlite:///my_database.db
Done.

[(27.6,)]

h) The total rainfall for each season:

In [71]:
%%sql
SELECT Season, SUM(Rainfall) AS Total_Rainfall FROM Weather GROUP BY Season;

 * sqlite:///my_database.db
Done.

[('Fall', 569.0),
 ('Spring', 192.29999999999998),
 ('Summer', 1706.5),
 ('Winter', 230.1)]

# Question 9

In [73]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

# a) Uppercase version of all words:
a = [word.upper() for word in words]  
print(a)

# b) Lowercase version of all words:
b = [word.lower() for word in words]
print(b)

# c) List of word lengths:
c = [len(word) for word in words]
print(c)

# d) List containing the word in uppercase, lowercase, and the length of the word:
d = [[word.upper(), word.lower(), len(word)] for word in words]
print(d)

# e) List of words containing 4 or more characters:
e = [word for word in words if len(word) >= 4]
print(e)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']
['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
[3, 5, 5, 3, 5, 4, 3, 4, 3]
[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]
['quick', 'brown', 'jumps', 'over', 'lazy']